<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"43a10e0422c66825e021a94746e2dd8fc049ca4444360ddb52015c53e6809ae6","plan_job_ref":"Job Dockerization #4 at https://github.com/presleyEOmozuwa/RubbleStore/actions/runs/10915435590","plan_out_hash":"35f470e2aa2f11444173fdae367dae7a662a9c00a195ce049318b33d764be5d6","plan_hash":"fe99ba7b6495f9ee0eed00a59fff9012c14717544e7ff9e97b9d65cd0b7ed2d8","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./infra/__
<details>
<summary>Plan: 24 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.aws_ecr_repository.node_app will be created
+   resource "aws_ecr_repository" "node_app" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "node_app"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.eks.aws_ecr_repository.react_app will be created
+   resource "aws_ecr_repository" "react_app" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "react_app"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.eks.aws_eks_cluster.ekscluster will be created
+   resource "aws_eks_cluster" "ekscluster" {
+       arn                           = (known after apply)
+       bootstrap_self_managed_addons = true
+       certificate_authority         = (known after apply)
+       cluster_id                    = (known after apply)
+       created_at                    = (known after apply)
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       identity                      = (known after apply)
+       name                          = "ekscluster"
+       platform_version              = (known after apply)
+       role_arn                      = (known after apply)
+       status                        = (known after apply)
+       tags_all                      = (known after apply)
+       version                       = (known after apply)

+       access_config (known after apply)

+       kubernetes_network_config (known after apply)

+       upgrade_policy (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.nodegroup will be created
+   resource "aws_eks_node_group" "nodegroup" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = (known after apply)
+       cluster_name           = "ekscluster"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = (known after apply)
+       node_group_name        = "nodegroup"
+       node_group_name_prefix = (known after apply)
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = (known after apply)
+       tags_all               = (known after apply)
+       version                = (known after apply)

+       scaling_config {
+           desired_size = 2
+           max_size     = 3
+           min_size     = 2
        }

+       update_config {
+           max_unavailable = 1
        }
    }

  # module.eks.aws_iam_role.eksrole will be created
+   resource "aws_iam_role" "eksrole" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eksrole"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.noderole will be created
+   resource "aws_iam_role" "noderole" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "noderole"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eksrole-AmazonEKSClusterPolicy will be created
+   resource "aws_iam_role_policy_attachment" "eksrole-AmazonEKSClusterPolicy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = "eksrole"
    }

  # module.eks.aws_iam_role_policy_attachment.eksrole-AmazonEKSVPCResourceController will be created
+   resource "aws_iam_role_policy_attachment" "eksrole-AmazonEKSVPCResourceController" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = "eksrole"
    }

  # module.eks.aws_iam_role_policy_attachment.noderole-AmazonEC2ContainerRegistryReadOnly will be created
+   resource "aws_iam_role_policy_attachment" "noderole-AmazonEC2ContainerRegistryReadOnly" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "noderole"
    }

  # module.eks.aws_iam_role_policy_attachment.noderole-AmazonEKSWorkerNodePolicy will be created
+   resource "aws_iam_role_policy_attachment" "noderole-AmazonEKSWorkerNodePolicy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = "noderole"
    }

  # module.eks.aws_iam_role_policy_attachment.noderole-AmazonEKS_CNI_Policy will be created
+   resource "aws_iam_role_policy_attachment" "noderole-AmazonEKS_CNI_Policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = "noderole"
    }

  # module.k8s.kubernetes_deployment.node_app will be created
+   resource "kubernetes_deployment" "node_app" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "App" = "node-app"
            }
+           name             = "node-app"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "2"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "App" = "node-app"
                }
            }

+           strategy (known after apply)

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "App" = "node-app"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }
+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   scheduler_name                   = (known after apply)
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       image                      = (known after apply)
+                       image_pull_policy          = (known after apply)
+                       name                       = "node-app"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       port {
+                           container_port = 5000
+                           protocol       = "TCP"
                        }

+                       resources {
+                           limits   = {
+                               "cpu"    = "0.5"
+                               "memory" = "512Mi"
                            }
+                           requests = {
+                               "cpu"    = "250m"
+                               "memory" = "50Mi"
                            }
                        }
                    }

+                   image_pull_secrets (known after apply)

+                   readiness_gate (known after apply)
                }
            }
        }
    }

  # module.k8s.kubernetes_deployment.react_app will be created
+   resource "kubernetes_deployment" "react_app" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "App" = "react-app"
            }
+           name             = "react-app"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "2"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "App" = "react-app"
                }
            }

+           strategy (known after apply)

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "App" = "react-app"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }
+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   scheduler_name                   = (known after apply)
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       image                      = (known after apply)
+                       image_pull_policy          = (known after apply)
+                       name                       = "react-app"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       port {
+                           container_port = 3000
+                           protocol       = "TCP"
                        }

+                       resources {
+                           limits   = {
+                               "cpu"    = "0.5"
+                               "memory" = "512Mi"
                            }
+                           requests = {
+                               "cpu"    = "250m"
+                               "memory" = "50Mi"
                            }
                        }
                    }

+                   image_pull_secrets (known after apply)

+                   readiness_gate (known after apply)
                }
            }
        }
    }

  # module.k8s.kubernetes_ingress.app_ingress will be created
+   resource "kubernetes_ingress" "app_ingress" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "alb.ingress.kubernetes.io/listen-ports" = jsonencode(
                    [
+                       {
+                           HTTP = 80
                        },
+                       {
+                           HTTPS = 443
                        },
                    ]
                )
+               "alb.ingress.kubernetes.io/scheme"       = "internet-facing"
            }
+           generation       = (known after apply)
+           name             = "app-ingress"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           rule {
+               host = "example.com"

+               http {
+                   path {
+                       path = "/api*"

+                       backend {
+                           service_name = "node-service"
+                           service_port = "5000"
                        }
                    }
+                   path {
+                       path = "/*"

+                       backend {
+                           service_name = "react-service"
+                           service_port = "3000"
                        }
                    }
                }
            }
        }
    }

  # module.k8s.kubernetes_service.node_app will be created
+   resource "kubernetes_service" "node_app" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           name             = "node-service"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           allocate_load_balancer_node_ports = true
+           cluster_ip                        = (known after apply)
+           cluster_ips                       = (known after apply)
+           external_traffic_policy           = (known after apply)
+           health_check_node_port            = (known after apply)
+           internal_traffic_policy           = (known after apply)
+           ip_families                       = (known after apply)
+           ip_family_policy                  = (known after apply)
+           publish_not_ready_addresses       = false
+           selector                          = {
+               "app" = "node-app"
            }
+           session_affinity                  = "None"
+           type                              = "ClusterIP"

+           port {
+               node_port   = (known after apply)
+               port        = 5000
+               protocol    = "TCP"
+               target_port = "5000"
            }

+           session_affinity_config (known after apply)
        }
    }

  # module.k8s.kubernetes_service.react_app will be created
+   resource "kubernetes_service" "react_app" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           name             = "react-service"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           allocate_load_balancer_node_ports = true
+           cluster_ip                        = (known after apply)
+           cluster_ips                       = (known after apply)
+           external_traffic_policy           = (known after apply)
+           health_check_node_port            = (known after apply)
+           internal_traffic_policy           = (known after apply)
+           ip_families                       = (known after apply)
+           ip_family_policy                  = (known after apply)
+           publish_not_ready_addresses       = false
+           selector                          = {
+               "app" = "react-app"
            }
+           session_affinity                  = "None"
+           type                              = "ClusterIP"

+           port {
+               node_port   = (known after apply)
+               port        = 3000
+               protocol    = "TCP"
+               target_port = "3000"
            }

+           session_affinity_config (known after apply)
        }
    }

  # module.vpc.aws_internet_gateway.igw will be created
+   resource "aws_internet_gateway" "igw" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "rubbles-igw"
        }
+       tags_all = {
+           "Name" = "rubbles-igw"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.routetable will be created
+   resource "aws_route_table" "routetable" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
#                (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "rubbles-rt"
        }
+       tags_all         = {
+           "Name" = "rubbles-rt"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.rta_1 will be created
+   resource "aws_route_table_association" "rta_1" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.rta_2 will be created
+   resource "aws_route_table_association" "rta_2" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.sg will be created
+   resource "aws_security_group" "sg" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3000
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 5000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5000
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "rubbles-sg"
        }
+       tags_all               = {
+           "Name" = "rubbles-sg"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet_1 will be created
+   resource "aws_subnet" "public_subnet_1" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "public-subnet_1"
        }
+       tags_all                                       = {
+           "Name" = "public-subnet_1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet_2 will be created
+   resource "aws_subnet" "public_subnet_2" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "public-subnet_2"
        }
+       tags_all                                       = {
+           "Name" = "public-subnet_2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "admin-vpc"
        }
+       tags_all                             = {
+           "Name" = "admin-vpc"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Dockerization #4](https://github.com/presleyEOmozuwa/RubbleStore/actions/runs/10915435590)